Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Use ConfigMaps as a configuration source for your Quarkus applications.
ja_jp: ConfigMapsをQuarkusアプリケーションの設定ソースとして使用します。

source: Use Ctrl-C to stop the Quarkus server.
ja_jp: Ctrl-Cを使用してQuarkusサーバーを停止します。

source: Use Custom HTTP Options
ja_jp: カスタムHTTPオプションの使用

source: Use Custom RestClient ClientFilter
ja_jp: カスタム RestClient ClientFilter の使用

source: Use Dev Services for Keycloak
ja_jp: Dev Services for Keycloakの使用

source: Use Dev Services for PostgreSQL to test your application
ja_jp: Dev Services for PostgreSQLを使用してアプリケーションをテストする

source: Use Funqy HTTP binding with Microsoft Azure Functions to deploy your serverless Quarkus applications.
ja_jp: サーバーレスQuarkusアプリケーションのデプロイには、Microsoft Azure FunctionsとFunqy HTTPバインディングを使用してください。

source: Use Gradle to create a new project, add or remove extensions, launch development mode, debug your application, and build your application into a jar, native executable, or container-friendly executable. Import your project into your favorite IDE using Gradle project metadata.
ja_jp: Gradleを使用して、新しいプロジェクトを作成し、エクステンションを追加または削除し、開発モードを起動し、アプリケーションをデバッグし、アプリケーションをjar、ネイティブ実行可能ファイル、またはコンテナフレンドリーな実行ファイルにビルドします。Gradleプロジェクトのメタデータを使用して、お気に入りのIDEにプロジェクトをインポートします。

source: Use HTTP Security Policy inclusive path-based authentication
ja_jp: HTTP セキュリティーポリシーの統合パスベース認証を使用する

source: Use HTTP Security Policy to enable path-based authentication
ja_jp: HTTP セキュリティーポリシーを使用してパスベース認証を有効にする

source: Use HTTP Security policy to secure an HTTP upgrade
ja_jp: HTTP セキュリティーポリシーを使用して HTTP アップグレードを保護する

source: Use HTTP security policy to require that `SecurityIdentity` must have either `user` or `admin` roles for the requests to be authorized.
ja_jp: HTTP セキュリティーポリシーを使用して、リクエストを認可するには `SecurityIdentity` に `user` または `admin` ロールが必要であることを要求します。

source: Use HTTPS with Basic Authentication to avoid exposing the credentials. The risk of exposing credentials as plain text increases if a load balancer terminates HTTPS, as the request is forwarded to Quarkus over HTTP.
ja_jp: Basic認証で HTTPS を使用すると、クレデンシャルが公開されるのを防ぐことができます。ロードバランサーがHTTPSを終端すると、要求がHTTPでQuarkusに転送されるため、クレデンシャルが平文で公開されるリスクが高まります。

source: Use HTTPS with Basic authentication to avoid exposing the credentials. The risk of exposing credentials as plain text increases if a load balancer terminates HTTPS because the request is forwarded to Quarkus over HTTP. Furthermore, in multi-hop deployments, the credentials can be exposed if HTTPS is used between the client and the first Quarkus endpoint only, and the credentials are propagated to the next Quarkus endpoint over HTTP.
ja_jp: クレデンシャルが公開されないようにするに、Basic認証でHTTPSを使用してください。 リクエストがHTTP経由でQuarkusに転送されるため、ロードバランサーがHTTPSを終端すると、クレデンシャルがプレーンテキストとして公開されるリスクが高まります。 さらに、マルチホップ展開では、クライアントと最初のQuarkusエンドポイント間のみでHTTPSが使用され、クレデンシャルがHTTP経由で次のQuarkusエンドポイントに伝搬される場合、クレデンシャルが露出する可能性があります。

source: Use Hibernate Search in Standalone mode with Elasticsearch/OpenSearch
ja_jp: Elasticsearch/OpenSearch を使用する Standalone モードでの Hibernate Search の使用

source: Use Hibernate Search with Hibernate ORM and Elasticsearch/OpenSearch
ja_jp: Hibernate ORMとElasticsearch/OpenSearchでHibernate Searchを使用

source: Use Infinispan Dev Services to run a server and connect without configuration.
ja_jp: Infinispan Dev Services を使用してサーバーを実行し、設定なしで接続します。

source: Use Infinispan as the Quarkus cache backend
ja_jp: InfinispanをQuarkusキャッシュバックエンドとして使用します。

source: Use JBoss Logging for application logging
ja_jp: アプリケーションのロギングに JBoss Logging を使用

source: Use JWT bearer token to authenticate OIDC provider client, see the link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[Using JWTs for Client Authentication] section for more information.
ja_jp: JWT ベアラートークンを使用して OIDC プロバイダークライアントを認証します。詳細は、link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[JWT を使用したクライアント認証] セクションを参照してください。

source: Use Kogito to add DRL files with rules.
ja_jp: Kogitoを使用して、ルール付きのDRLファイルを追加します。

source: Use Kogito to add business automation and power it up with DMN decision support.
ja_jp: Kogitoを使用してDMN意思決定サポートでパワーアップし、ビジネス自動化を追加します。

source: Use Kogito to add business automation to power it up with predictions.
ja_jp: Kogitoを使用して予測でパワーアップし、ビジネス自動化を追加します。

source: Use MDC to add contextual log information
ja_jp: MDCを使用してコンテキストログ情報を追加

source: Use Manual instrumentation if there are no other alternatives because it will require more maintenance work.
ja_jp: より多くのメンテナンス作業が必要になるため、他に選択肢がない場合にのみ手動計装を使用してください。

source: Use Maven to build the application using `mvn clean package`, it will generate a single JAR that contains all the classes of your application including its dependencies.
ja_jp: `mvn clean package` を使用してアプリケーションをビルドするために Maven を使用します。依存関係を含むアプリケーションのすべてのクラスを含む単一の JAR を生成します。

source: Use Maven to create a new project, add or remove extensions, launch development mode, debug your application, and build your application into a jar, native executable, or container-friendly executable. Import your project into your favorite IDE using Maven project metadata.
ja_jp: Mavenを使用して、新しいプロジェクトを作成し、エクステンションを追加または削除し、開発モードを起動し、アプリケーションをデバッグし、アプリケーションをjar、ネイティブ実行可能ファイル、またはコンテナに適した実行可能ファイルにビルドします。Mavenプロジェクトのメタデータを使用して、お気に入りのIDEにプロジェクトをインポートします。

source: Use MicroProfile Config to inject any configuration attributes you need to configure the registry. Most Micrometer registry extensions, like `quarkus-micrometer-registry-statsd`, provide registry-specific configuration objects that are integrated with the Quarkus configuration model. The link:https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkiverse GitHub Repository] can be a useful implementation reference.
ja_jp: MicroProfile Config を使用して、レジストリーを設定するために必要な設定属性を挿入します。 `quarkus-micrometer-registry-statsd` などのほとんどの Micrometer レジストリーエクステンションは、Quarkus 設定モデルと統合されたレジストリー固有の設定オブジェクトを提供します。 link:https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkiverse GitHub リポジトリー] は、便利な実装リファレンスになります。

source: Use Micrometer to collect metrics produced by Quarkus, its extensions, and your application.
ja_jp: Micrometerを使用して、Quarkus、そのエクステンション、アプリケーションによって生成されるメトリクスを収集します。

source: Use Mockito to mock the call of the RemoteCache
ja_jp: Mockitoを使用して、RemoteCacheの呼び出しをモックします。

source: Use OidcClient directly
ja_jp: OidcClient を直接使用する

source: Use OidcClient in RestClient ClientFilter
ja_jp: RestClient の ClientFilter で OidcClient を使用する

source: Use OidcClient in RestClient Reactive ClientFilter
ja_jp: RestClient の Reactive ClientFilter で OidcClient を使用する

source: Use OidcClients
ja_jp: OidcClients を使用する

source: Use Podman instead of Docker for running containers.
ja_jp: コンテナの実行には、Dockerの代わりにPodmanを使用します。

source: Use Redis as the Quarkus cache backend
ja_jp: QuarkusのキャッシュバックエンドとしてRedisを使用

source: Use Redis data sources
ja_jp: Redisデータソースの使用

source: Use Redis transactions
ja_jp: Redisトランザクションの使用

source: Use Spring Boot's @ConfigurationProperties in place of MicroProfile Config annotations
ja_jp: MicroProfile Configアノテーションの代わりにSpring Bootの@ConfigurationPropertiesを使用します。

source: Use Spring Boot's `@ConfigurationProperties` in place of MicroProfile Config annotations
ja_jp: MicroProfile Config アノテーションの代わりに Spring Boot の `@ConfigurationProperties` を使用します

source: Use Spring Data JPA annotations to create your data access layer
ja_jp: Spring Data JPA アノテーションを使用してデータアクセス層を作成する

source: Use Spring Web annotations to create your REST services
ja_jp: Spring Web アノテーションを使用して REST サービスを作成する

source: Use Swagger UI for development
ja_jp: 開発にSwagger UIを使用する

source: Use TLS
ja_jp: TLS の使用

source: Use Unix Socket
ja_jp: Unixソケットの使用

source: Use Vert.x JSON
ja_jp: Vert.x JSONの使用

source: Use Vert.x clients
ja_jp: vert.xクライアントを使用

source: Use Verticles
ja_jp: Verticlesの使用

source: Use Wiremock for Integration Testing
ja_jp: 結合テストに Wiremock を使用する

source: Use `--help` to display help information with all the available commands:
ja_jp: `--help` を使用して、使用可能なすべてのコマンドと共にヘルプ情報を表示します。

source: Use `-Dbuild-projects=true` when running this test to generate the real project with your codestart. Open it with your IDE, then change the code and copy it back to the codestart (and iterate until you are happy with the result).
ja_jp: このテストを実行する際に `-Dbuild-projects=true` を使用して、codestart で実際のプロジェクトを生成します。それをIDEで開き、コードを変更してcodestartにコピーし直します（結果に満足するまで繰り返します）。

source: Use `:toc: preamble` in the document header to insert an automatically generated TOC after the abstract (or preamble) to the document. For example, this document has the following in its header:
ja_jp: 文書のヘッダーで `:toc: preamble` を使うと、文書のアブストラクト (またはプリアンブル) の後に自動生成された TOC を挿入できます。たとえば、この文書のヘッダーには次のように書かれています：

source: Use `@Alternative` without a `@Priority`. Make sure you don't use `@Mock`.
ja_jp: `Alternative` を `@Priority` なしで使用します。 `@Mock` を使用しないことを確認してください。

source: Use `@Inject Logger log` when you want Quarkus to name the logger after the class it is injected into.
ja_jp: ロガー名を注入先のクラス名にしたい場合は、 `@Inject Logger log` を使用します。

source: Use `@LoggerName("...") Logger log` when you want to set the logger name explicitly.
ja_jp: ロガー名を明示的に設定したい場合は、 `@LoggerName("...") Logger log` を使用します。

source: Use `@Query` in place of `@HQL`, they're the same everything
ja_jp: `@HQL` の代わりに `@Query` を使用します。これらはすべて同じです。

source: Use `@ServiceDiscoveryAttribute` to define configuration properties for services configured with this service discovery provider. Configuration properties are gathered from all properties of a form: `quarkus.stork.my-service.service-discovery.attr=value`.
ja_jp: このサービスディスカバリープロバイダーで構成されたサービスの設定プロパティを定義するには、 `@ServiceDiscoveryAttribute` を使用します。設定プロパティは、フォームのすべてのプロパティから次の形で収集されます: `stork.my-service.service-discovery.attr=value`.

source: Use `@ServiceDiscoveryAttribute` to define configuration properties for services configured with this service discovery provider. Configuration properties are gathered from all properties of a form: `stork.my-service.service-discovery.attr=value`.
ja_jp: `@ServiceDiscoveryAttribute` を使用して、このサービスディスカバリープロバイダで設定されるサービスの設定プロパティを定義します。設定プロパティは、フォームのすべてのプロパティから収集されます： `stork.my-service.service-discovery.attr=value` 。

source: Use `@io.smallrye.config.ConfigMapping` annotation to group multiple configurations in a single interface. Please, check the https://smallrye.io/docs/smallrye-config/main/mapping/mapping.html[Config Mappings] documentation.
ja_jp: `@io.smallrye.config.ConfigMapping` アノテーションを使用して、複数の設定を1つのインターフェイスにまとめます。 link:https://smallrye.io/docs/smallrye-config/main/mapping/mapping.html[Config Mappings]のドキュメントを参照してください。

source: Use `@io.smallrye.config.ConfigMapping` annotation to group multiple configurations in a single interface. Please, check the https://smallrye.io/smallrye-config/Main/config/mappings/[Config Mappings] documentation.
ja_jp: `@io.smallrye.config.ConfigMapping` アノテーションを使用して、複数の設定を1つのインターフェイスにまとめます。 link:https://smallrye.io/smallrye-config/Main/config/mappings/[Config Mappings] のドキュメントを参照してください。

source: Use `@io.smallrye.config.ConfigMapping` annotation to group multiple configurations in a single interface. Please, check the https://smallrye.io/smallrye-config/latest/config/mappings/[Config Mappings] documentation.
ja_jp: `@io.smallrye.config.ConfigMapping` アノテーションを使用して、複数の設定を1つのインターフェイスにまとめます。 https://smallrye.io/smallrye-config/latest/config/mappings/[設定マッピング]のドキュメントを参照してください。

source: Use `ApiEchoServiceClient` to echo the user name.
ja_jp: `ApiEchoServiceClient` を使用してユーザー名をエコーします。

source: Use `Counter.builder` to provide a description and units:
ja_jp: 説明と単位を指定するには、`Counter.builder` を使用します。

source: Use `DistributionSummary.builder` to provide a description and units:
ja_jp: 説明と単位を指定するには、`DistributionSummary.builder` を使用します。

source: Use `HttpClientMetricsTagsContributor` for client HTTP requests
ja_jp: クライアントの HTTP リクエストには `HttpClientMetricsTagsContributor` を使用する

source: Use `HttpServerMetricsTagsContributor` for server HTTP requests
ja_jp: サーバーの HTTP リクエストに `HttpServerMetricsTagsContributor` を使用する

source: Use `KafkaCompanion` to create producer task which writes 10 records to 'orders' topic.
ja_jp: `KafkaCompanion` を使用して、10 のレコードを 'orders' トピックに書き込むプロデューサータスクを作成します。

source: Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`. If you need to do integration testing against Keycloak, you are encouraged to use <<code-flow-integration-testing-keycloak-devservices,Dev Services for Keycloak>>.
ja_jp: `Dev Services for Keycloak` を使用しない正当な理由がある場合にのみ、テストには `KeycloakTestResourceLifecycleManager` を使用してください。 Keycloak に対する結合テストが必要な場合は、<<code-flow-integration-testing-keycloak-devservices,Dev Services for Keycloak>> を使用してテストすることをお勧めします。

source: Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`. If you need to do the integration testing against Keycloak then you are encouraged to do it with <<code-flow-integration-testing-keycloak-devservices,Dev Services for Keycloak>>.
ja_jp: `Dev Services for Keycloak` を使用しない正当な理由がある場合にのみ、テストには `KeycloakTestResourceLifecycleManager` を使用してください。 Keycloak に対する結合テストが必要な場合は、<<code-flow-integration-testing-keycloak-devservices,Dev Services for Keycloak>> を使用してテストすることを推奨します。

source: Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`. If you need to do the integration testing against Keycloak then you are encouraged to do it with xref:integration-testing-keycloak-devservices[Dev services For Keycloak].
ja_jp: `Dev Services for Keycloak` を使用しない正当な理由がある場合のみ、テストに `KeycloakTestResourceLifecycleManager` を使用してください。Keycloakに対する統合テストを行う必要がある場合は、 xref:integration-testing-keycloak-devservices[Dev services For Keycloak] で行うことが推奨されます。

source: Use `MailTemplate` injection for the named mailer configurations.
ja_jp: 名前付きメーラーの設定には、 `MailTemplate` 注入を使用してください。

source: Use `MeterFilter` to customize emitted tags and metrics
ja_jp: `MeterFilter` を使用して、発行されるタグとメトリクスをカスタマイズします。

source: Use `MeterRegistryCustomizer` for arbitrary customizations to meter registries
ja_jp: メーターレジストリーを任意にカスタマイズする `MeterRegistryCustomizer` の使用

source: Use `OidcClient` to acquire the tokens and propagate them:
ja_jp: `OidcClient` を使用してトークンを取得し、伝播します。

source: Use `OidcConfigurationMetadata` to filter requests to the OIDC token endpoint only.
ja_jp: `OidcConfigurationMetadata` を使用して、OIDC トークンエンドポイントへのリクエストのみをフィルターします。

source: Use `OidcRequestContextProperties` request properties to check only an `authorization_code` token grant response for the `code-flow-user-info-cached-in-idtoken` tenant.
ja_jp: `OidcRequestContextProperties` リクエストプロパティーを使用して、 `code-flow-user-info-cached-in-idtoken` テナントの `authorization_code` トークングラントレスポンスのみをチェックします。

source: Use `OidcRequestContextProperties` request properties to confirm it is a `refresh_grant` token grant response.
ja_jp: `OidcRequestContextProperties` リクエストプロパティーを使用して、ヘッダーが `refresh_grant` トークングラント応答であることを確認します。

source: Use `OidcRequestContextProperties` request properties to get the tenant id.
ja_jp: テナント ID を取得するには、 `OidcRequestContextProperties` リクエストプロパティーを使用します。

source: Use `Timer.builder` to provide a description and units:
ja_jp: 説明と単位を指定するには、`Timer.builder` を使用します。

source: Use `Uni` when you have a single result. Use `Multi` when you have multiple items that may be emitted asynchronously.
ja_jp: 単一の結果がある場合は `Uni` を使用します。 `Multi` は、非同期的に放出される可能性のある複数の項目がある場合に使用します。

source: Use `assistantFunction` instead of `function` to access the assistant context.
ja_jp: アシスタントコンテキストにアクセスするために、 `function` の代わりに `assistantFunction` を使用します。

source: Use `assistantFunction` to receive the `Assistant` instance and xref:dev-ui.adoc#input[input] parameters.
ja_jp: `assistantFunction` を使用して、 `Assistant` インスタンスと xref:dev-ui.adoc#input[入力] パラメーターを受け取ります。

source: Use `bytes` as a base unit. See link:{base-units}[BaseUnits.java] for predefined values.
ja_jp: 基本単位として `bytes` を使用します。事前定義された値については link:{base-units}[BaseUnits.java] を参照してください。

source: Use `client_credentials` grant type.
ja_jp: `client_credentials` グラントタイプを使用する。

source: Use `curl` or a browser to test your application
ja_jp: `curl` またはブラウザを使用して、アプリケーションをテストします

source: Use `debug` logging to show every _step_:
ja_jp: `debug` ロギングを使用して、すべての _ステップ_ を表示します。

source: Use `docs/src/main/asciidoc/_templates/template-concept.adoc`
ja_jp: `docs/src/main/asciidoc/_templates/template-concept.adoc` を使用します

source: Use `docs/src/main/asciidoc/_templates/template-concepts.adoc`
ja_jp: `docs/src/main/asciidoc/_templates/template-concepts.adoc` の使用

source: Use `docs/src/main/asciidoc/_templates/template-howto.adoc`
ja_jp: `docs/src/main/asciidoc/_templates/template-howto.adoc` の使用

source: Use `docs/src/main/asciidoc/_templates/template-reference.adoc`
ja_jp: `docs/src/main/asciidoc/_templates/template-reference.adoc` の使用

source: Use `docs/src/main/asciidoc/_templates/template-tutorial.adoc`
ja_jp: `docs/src/main/asciidoc/_templates/template-tutorial.adoc` の使用

source: Use `io.quarkus.oidc.runtime.TenantConfigBean` to get the already resolved tenant configuration. Alternatively, you can use the tenant `OidcTenantConfig` cached in your resolver.
ja_jp: すでに解決されたテナント設定を取得するには、`io.quarkus.oidc.runtime.TenantConfigBean` を使用します。あるいは、リゾルバーにキャッシュされているテナント `OidcTenantConfig` を使用することもできます。

source: Use `mp.jwt.verify.publickey.algorithm` to customize the verification algorithm (default is `RS256`), for example, set it to `ES256` when working with the EC keys.
ja_jp: `mp.jwt.verify.publickey.algorithm` を使用して検証アルゴリズムをカスタマイズします (デフォルトは `RS256`)。たとえば、EC 鍵を操作する場合は `ES256` に設定します。

source: Use `mp.jwt.verify.publickey.algorithm` to customize the verification algorithm (default is `RS256`); for example, set it to `ES256` when working with the EC keys.
ja_jp: `mp.jwt.verify.publickey.algorithm` を使用して検証アルゴリズムをカスタマイズします (デフォルトは `RS256`)。たとえば、EC 鍵を操作する場合は `ES256` に設定します。

source: Use `password` grant type.
ja_jp: `password` グラントタイプを使用する。

source: Use `quarkus-keycloak-authorization` only if you work with Keycloak and have Keycloak Authorization Services enabled to make authorization decisions. Use `quarkus-oidc` if you do not work with Keycloak or work with Keycloak but do not have its Keycloak Authorization Services enabled to make authorization decisions.
ja_jp: Keycloakと連携し、Keycloak Authorization Servicesを有効にして認可の決定を行う場合のみ、 `quarkus-keycloak-authorization` を使用してください。Keycloakと連携していない場合、またはKeycloakと連携しているが、そのKeycloak Authorization Servicesが認可の決定を行うことを有効にしていない場合は、 `quarkus-oidc` を使用してください。

source: Use `quarkus.http.access-log.exclude-pattern=/some/path/.*` to exclude all entries concerning the path `/some/path/...` (_including subsequent paths_) from the log.
ja_jp: `quarkus.http.access-log.exclude-pattern=/some/path/.*` を使用すると、パス `/some/path/…​` （ _それ以降のパスも含む_ ）に関するすべてのエントリーをログから除外します。

source: Use `quarkus.oidc.tls-configuration-name` to reference a xref:tls-registry-reference.adoc[TLS Registry] configuration that can be required when the OIDC provider requires an HTTPS connection or Quarkus OIDC provider client must use MTLS authentication.
ja_jp: OIDC プロバイダーが HTTPS 接続を必要とする場合や、Quarkus OIDC プロバイダークライアントが MTLS 認証を使用する必要がある場合に、 xref:tls-registry-reference.adoc[TLS レジストリー] 設定を参照するには `quarkus.oidc.tls-configuration-name` を使用します。

source: Use `trace` logging to show every _step_ and every _move_ per step.
ja_jp: `trace` ロギングを使用して、すべての _ステップ_ と、ステップごとのすべての _動き_ を表示します。

source: Use a JWT bearer token to authenticate the OIDC provider client. For more information, see the link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[Using JWTs for Client Authentication] section.
ja_jp: JWT ベアラートークンを使用して OIDC プロバイダークライアントを認証します。 詳細については、link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[JWT を使用したクライアント認証] セクションを参照してください。

source: Use a Java record that implements `io.quarkus.qute.TemplateInstance`; the record components represent the template parameters and `@io.quarkus.qute.CheckedTemplate` can be optionally used to configure the template.
ja_jp: `io.quarkus.qute.TemplateInstance` を実装する Java レコードを使用します。レコードコンポーネントはテンプレートパラメーターを表し、オプションで `@io.quarkus.qute.CheckedTemplate` を使用してテンプレートを設定できます。

source: Use a Unix domain socket
ja_jp: Unixドメインソケットの使用

source: Use a Vert.x context-aware scheduler
ja_jp: Vert.x コンテキスト対応スケジューラの使用

source: Use a `@quarkus.oidc.TenantFeature` annotation to bind a custom Validator to a specific OIDC tenant only.
ja_jp: カスタム Validator を特定の OIDC テナントにのみバインドするには、 `@quarkus.oidc.TenantFeature` アノテーションを使用します。

source: Use a `MeterRegistry` member variable and use `@Inject`:
ja_jp: `MeterRegistry` メンバー変数を使用し、`@Inject` を使用します。

source: Use a `NonApplicationRootPathBuildItem` to define an endpoint:
ja_jp: `NonApplicationRootPathBuildItem` を使用して、エンドポイントを定義します:

source: Use a `Sample` for more complex code paths:
ja_jp: より複雑なコードパスには `Sample` を使用します。

source: Use a builder to create a Gauge that will call a function:
ja_jp: ビルダーを使用して、関数を呼び出すゲージを作成します。

source: Use a centralized location to efficiently collect, store, and analyze log data from various components and application instances.
ja_jp: 一元化された場所を使用して、さまざまなコンポーネントやアプリケーションインスタンスからのログデータを効率的に収集、保存、分析します。

source: Use a centralized location to efficiently collect, store, and analyze log data from various components and instances of the application.
ja_jp: アプリケーションのさまざまなコンポーネントやインスタンスからログデータを効率的に収集、保存、分析するために、一元化された場所を使用します。

source: Use a class/method substitution to remove the said reference.
ja_jp: クラス/メソッド置換を使用して、当該参照を削除する。

source: Use a common prefix to group related documents, e.g. all of the documents related to writing Quarkus docs are prefixed with `doc-`.
ja_jp: 関連するドキュメントをグループ化するために、共通の接頭辞を使用します。例えば、Quarkus のドキュメントを書くことに関連するすべてのドキュメントは、プレフィックスとして`doc-`が付きます。

source: Use a common prefix to group related documents. Documents related to writing and contributing to Quarkus docs share the `doc-` prefix, for example.
ja_jp: 関連するドキュメントをグループ化するには、共通の接頭辞を使用します。例えば、Quarkusのドキュメントを書いたり貢献したりすることに関連するドキュメントは、 `doc-` というプレフィックスを共有します。

source: Use a common prefix to group-related documents. Documents related to writing and contributing to Quarkus docs share the `doc-` prefix, for example.
ja_jp: 関連ドキュメントをグループ化するには、共通の接頭辞を使用します。例えば、Quarkusドキュメントの執筆や貢献に関連するドキュメントは、 `doc-` というプレフィックスを共有します。

source: Use a convenience method on the `MeterRegistry`:
ja_jp: `MeterRegistry` の便利なメソッドを使用します。

source: Use a custom RestClient ClientFilter
ja_jp: カスタムの RestClient ClientFilter を使用する

source: Use a custom WebSocket ticket system which supplies a random token with the HTML page which hosts the JavaScript WebSockets client which must provide this token during the initial handshake request as a query parameter.
ja_jp: ランダムトークンを HTML ページに提供するカスタム WebSocket チケットシステムを使用します。この HTML ページは、ハンドシェイクリクエストの開始時にクエリーパラメーターとしてこのトークンを提供する必要がある JavaScript WebSocket クライアントをホストします。

source: Use a custom `@Produces` method to create and configure a customized `MeterRegistry` if you need to.
ja_jp: 必要に応じて、カスタム `@Produces` メソッドを使用して、カスタマイズされた `MeterRegistry` を作成して設定します。

source: Use a custom `@Produces` method to create and configure a your own `MeterRegistry` if you need to.
ja_jp: 必要に応じて、カスタム `@Produces` メソッドを使用し、独自の `MeterRegistry` を作成および設定します。

source: Use a custom `@Produces` method to create and configure your own `MeterRegistry` if you need to.
ja_jp: 必要に応じて、カスタム `@Produces` メソッドを使用して、独自の `MeterRegistry` を作成および設定します。

source: Use a custom `custom-root-path` path for Hibernate Search's management endpoint. If the default management root path is used then the reindex path becomes `/q/custom-root-path/reindex`.
ja_jp: Hibernate Search の管理エンドポイントにカスタムの `custom-root-path` パスを使用します。 デフォルトの管理ルートパスが使用される場合は、インデックスが再作成されたパスは `/q/custom-root-path/reindex` になります。

source: Use a database with no built-in extension or with a different driver
ja_jp: ビルトインエクステンションのないデータベースを使用するか、別のドライバーのあるデータベースを使用します。
